In [1]:
import pandas as pd
import numpy as np

# Load a sample dataset

In [2]:
df = pd.read_csv('data/titanic.csv')

# 1. Exploring the Data
## Show the first few rows of the dataframe

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
len(df)

891

### Get all row indexes

In [6]:
indexes = df.index
print(indexes)

RangeIndex(start=0, stop=891, step=1)

### Get all column indexes (names)

In [7]:
col_indexes = df.columns
print(col_indexes)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Get the name of the first column

In [8]:
first_column_name = df.columns[0]
print(first_column_name)

PassengerId

### transfer all columns to a list

In [9]:
df.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

## Show a summary of the dataframe (rows, columns, missing values)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
# Check data types
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
numerical_cols = df.select_dtypes(include=['int64', 'float64']).columns.to_list()
numerical_cols

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [13]:
categorical_cols = df.select_dtypes(include=['object', 'category', 'bool']).columns.to_list()
categorical_cols

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [14]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [15]:
df['Embarked'].nunique()

3

In [16]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [17]:
df['Sex'].nunique()

2

### Continuous and Discrete columns

In [18]:
continuous_cols = [col for col in numerical_cols if df[col].nunique() > 20 ]
discrete_cols = [col for col in numerical_cols if df[col].nunique() <= 20 ]

In [19]:
continuous_cols

['PassengerId', 'Age', 'Fare']

In [20]:
discrete_cols

['Survived', 'Pclass', 'SibSp', 'Parch']

# Identifying Numerical and Categorical Data
## List all numerical columns

In [21]:

numerical_cols = df.select_dtypes(include=[np.number]).columns.tolist()
print("Numerical columns:", numerical_cols)

Numerical columns: ['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

## List all categorical columns

In [22]:
categorical_cols = df.select_dtypes(exclude=[np.number]).columns.tolist()
print("Categorical columns:", categorical_cols)

Categorical columns: ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

# Homework 1: Introduction to Tabular Data

 **Create a Feature Type Dictionary:**
   - Load the Titanic dataset into a DataFrame.
   - Create a dictionary that classifies features:
     - **Numerical (continuous or discrete):** List of numerical features.
     - **Categorical (nominal or ordinal):** List of categorical features.

   ```python
   feature_types = {
       'numerical': {
           'continuous': [],  # Fill with continuous numerical features
           'discrete': []  # Fill with discrete numerical features
       },
       'categorical': {
           'nominal': [],  # Fill with nominal categorical features
           'ordinal': []  # Fill with ordinal categorical features
       }
   }

# Homework 2: Create a DataFrame with Only Numerical Features:
### Use DataFrame selection to create a new DataFrame that contains only numerical features from the Titanic dataset.
```python
numerical_df = df[['list', 'of', 'numerical', 'features']]

# Homework 3: Display Unique Values for Categorical Columns:
### Select the categorical features and display the unique values for each categorical column.

# Homework 4: Create a Simple Summary Table:
### Create a summary DataFrame with columns such as Feature Name, Data Type, Number of Unique Values, and Has Missing Values?.